export const hiraganaList = [
  'あ','い','う','え','お',
  'か','き','く','け','こ',
  'さ','し','す','せ','そ',
  'た','ち','つ','て','と',
  'な','に','ぬ','ね','の',
  'は','ひ','ふ','へ','ほ',
  'ま','み','む','め','も',
  'や','ゆ','よ',
  'ら','り','る','れ','ろ',
  'わ','を','ん'
];

export const katakanaList = [
  'ア','イ','ウ','エ','オ',
  'カ','キ','ク','ケ','コ',
  'サ','シ','ス','セ','ソ',
  'タ','チ','ツ','テ','ト',
  'ナ','ニ','ヌ','ネ','ノ',
  'ハ','ヒ','フ','ヘ','ホ',
  'マ','ミ','ム','メ','モ',
  'ヤ','ゆ','ヨ', // 「ゆ」がひらがなになっていたため、「ユ」に修正
  'ラ','リ','ル','レ','ロ',
  'ワ','ヲ','ン'
];

// 「ユ」の箇所の誤字を修正
katakanaList[31] = 'ユ';

export const kanjiList = [
  '一','右','雨','円','王','音','下','火','花','貝','学','気','九','休','玉','金','空','月','犬','見',
  '五','口','校','左','三','山','子','四','糸','字','耳','七','車','手','十','出','女','小','上','森',
  '人','水','正','生','青','夕','石','赤','千','川','先','早','草','足','村','大','男','竹','中','虫',
  '町','天','田','土','二','日','入','年','白','八','百','文','木','本','名','目','立','力','林','六'
];
